# Testat

In [4]:
import scipy.stats as st
import pandas as pd
from pandas import DataFrame, Series
import numpy as np
import matplotlib.pyplot as plt

In [33]:
d = pd.read_csv("gamma.txt", delim_whitespace=True)

In [34]:
d

        Day  gamma
0   April 5  1.000
1   April 6  0.960
2   April 7  1.020
3   April 8  1.000
4   April 9  1.002
5  April 13  1.022
6  April 14  0.990
7  April 15  0.980
8  April 16  0.930

In [35]:
d['gamma']

0    1.000
1    0.960
2    1.020
3    1.000
4    1.002
5    1.022
6    0.990
7    0.980
8    0.930
Name: gamma, dtype: float64

In [32]:
dmean = d['gamma'].mean()
dmean

0.99675

In [36]:
d['gamma'].mad()

0.0217777777777778

In [38]:
norm.interval(alpha=0.95, loc=18, scale=0.9711/np.sqrt(18))

(17.551382932058008, 18.448617067941992)

In [23]:
s = pd.read_csv("Schokolade_Nobelpreis.txt", sep=" ", error_bad_lines=False)
s

b'Skipping line 8: expected 3 fields, saw 4\nSkipping line 11: expected 3 fields, saw 4\nSkipping line 19: expected 3 fields, saw 4\nSkipping line 22: expected 3 fields, saw 4\n'

,Country,Nobel Laureates per 10 Million,Chocolate consumption (kg) per capita
0,Sweden,30.677,4.4
1,Switzerland,30.125,10.2
2,Norway,24.947,9.2
3,Denmark,24.695,7.9
4,Austria,24.577,8.5
5,United Kingdom,19.315,8.8
6,Germany,13.013,9.1
7,Netherlands,11.226,4.5
8,France,9.473,4.9
9,Belgium,8.850,9.1
10,Finland,7.268,6.2
11,Canada,6.400,3.9
12,Australia,5.006,4.8
13,Italy,3.345,3.5
14,Portugal,1.932,2.0
15,Greece,1.826,2.5
16,Spain,1.735,1.6
17,Brazil,0.048,1.0

In [25]:
s.corr()

,Nobel Laureates per 10 Million,Chocolate consumption (kg) per capita
Nobel Laureates per 10 Million,1.000000,0.720586
Chocolate consumption (kg) per capita,0.720586,1.000000